Welcome to NAND!
NAND is a really simple DSL where you can only assign variables and NAND things
NAND expressions follow a very simple syntax
<line> = <exp> | <binding>
<exp> = '(' <exp> (<ws> <exp>)? ')' | <bool> | <string>
<binding> = <string> <ws> '=' <ws> (<string> | <bool>)
<bool> = '0' | '1'
<string> = ('a' | 'b' | .. | 'z')+
<ws> = ' '+
The semantics are also simple.
If an expression (exp) is encountered, evaluate it and print the result
If an assignment is encountered, assign that variable
So, enter an expression or an assignment
An expression could be something like the following
    nand> 0
    nand> 1
    nand> (0)
    nand> (1)
    nand> (0 1)
    nand> (0 (1 1))
An binding looks something like this
    nand> a = 0
    nand> b = 1
    nand> a = b
    nand> or = (a a)
After binding something, you can use it in your expressions
    nand> not = (a a)
    nand> a = 0
    nand> not
    1
    nand> a = 1
    nand> not
    0
Have fun!